# Task 4.6

## Step 3

### Import libraries and new combined data set

In [5]:
# Importing libraries

import pandas as pd
import numpy as np
import os

In [6]:
# define a path

path = r'C:\Users\junio\OneDrive\Career Foundry Project\01-2024 Instacart Basket Analysis'

In [7]:
# importing the orders_products_combined data set

df_ords_prods_combined = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_combined.pkl'))

## Step 4

### Check the shape of the imported dataframe

In [8]:
# Checking the dataframe shape

df_ords_prods_combined.shape

(32434489, 10)

In [9]:
# check head

df_ords_prods_combined.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order,product_id,add_to_cart_order,reordered,_merge
0,2539329,1,1,2,8,NaN,196,1,0,both
1,2539329,1,1,2,8,NaN,14084,2,0,both
2,2539329,1,1,2,8,NaN,12427,3,0,both
3,2539329,1,1,2,8,NaN,26088,4,0,both
4,2539329,1,1,2,8,NaN,26405,5,0,both

In [28]:
#Drop _merge column in df_ords_prods_combined

df_ords_prods_combined = df_ords_prods_combined.drop(columns = ['_merge'])

## Step 5

### Import products_checked data set

In [11]:
# import products data set from 'Prepared' folder

df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'products_checked.csv'), index_col = False)

### Checking, changing, and dropping actions

In [12]:
# check shape of products_checked data set

df_prods.shape

(49672, 6)

In [13]:
# checking the columns within 'df_prods'

df_prods.columns

Index(['Unnamed: 0', 'product_id', 'product_name', 'aisle_id', 'department_id',
       'prices'],
      dtype='object')

In [14]:
# check head

df_prods.head()

,Unnamed: 0,product_id,product_name,aisle_id,department_id,prices
0,0,1,Chocolate Sandwich Cookies,61,19,5.8
1,1,2,All-Seasons Salt,104,13,9.3
2,2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,4,5,Green Chile Anytime Sauce,5,13,4.3

In [15]:
# remove unnecessary columns 

df_prods.drop(columns = {'Unnamed: 0'}, inplace = True)

In [16]:
df_prods.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 49672 entries, 0 to 49671
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   product_id     49672 non-null  int64
 1   product_name   49672 non-null  object
 2   aisle_id       49672 non-null  int64
 3   department_id  49672 non-null  int64
 4   prices         49672 non-null  float64
dtypes: float64(1), int64(3), object(1)
memory usage: 1.9+ MB

In [17]:
# Change types for prods data set

df_prods['product_id']=df_prods['product_id'].astype('int32')
df_prods['aisle_id'] = df_prods['aisle_id'].astype('int32')
df_prods['departmend_id']=df_prods['department_id'].astype('int8')
df_prods['prices']=df_prods['prices'].astype('float32')

In [18]:
# check dimension of the type chenged version of the data set

df_prods.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 49672 entries, 0 to 49671
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   product_id     49672 non-null  int32
 1   product_name   49672 non-null  object
 2   aisle_id       49672 non-null  int32
 3   department_id  49672 non-null  int64
 4   prices         49672 non-null  float32
 5   departmend_id  49672 non-null  int8
dtypes: float32(1), int32(2), int64(1), int8(1), object(1)
memory usage: 1.4+ MB

In [19]:
# check new shape of products_checked data set

df_prods.shape

(49672, 6)

In [20]:
# checking the columns after dropping 

df_prods.columns

Index(['product_id', 'product_name', 'aisle_id', 'department_id', 'prices',
       'departmend_id'],
      dtype='object')

In [21]:
# check head again

df_prods.head()

,product_id,product_name,aisle_id,department_id,prices,departmend_id
0,1,Chocolate Sandwich Cookies,61,19,5.8,19
1,2,All-Seasons Salt,104,13,9.3,13
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5,7
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5,1
4,5,Green Chile Anytime Sauce,5,13,4.3,13

### Combine the orders_products_combined dataframe with the products data set

In [29]:
# Merging both data sets: orders_products_combined and products_checked

df_merged = df_prods.merge(df_ords_prods_combined, on = 'product_id', indicator = True)

In [31]:
df_merged.shape

(32404859, 15)

In [32]:
df_merged.head()

,product_id,product_name,aisle_id,department_id,prices,departmend_id,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order,add_to_cart_order,reordered,_merge
0,1,Chocolate Sandwich Cookies,61,19,5.8,19,3139998,138,28,6,11,3.0,5,0,both
1,1,Chocolate Sandwich Cookies,61,19,5.8,19,1977647,138,30,6,17,20.0,1,1,both
2,1,Chocolate Sandwich Cookies,61,19,5.8,19,389851,709,2,0,21,6.0,20,0,both
3,1,Chocolate Sandwich Cookies,61,19,5.8,19,652770,764,1,3,13,NaN,10,0,both
4,1,Chocolate Sandwich Cookies,61,19,5.8,19,1813452,764,3,4,17,9.0,11,1,both

# Step 6

### Confirm the results of the merge using the merge flag

In [34]:
# check whether you have a full match or not. 
### They do have a full match  the default Join was applied (using how = 'inner')., tha is, Inner Join)
### and each of those rows have information found in both input data sets.

df_merged['_merge'].value_counts()

_merge
both          32404859
left_only            0
right_only           0
Name: count, dtype: int64

In [35]:
df_merged

,product_id,product_name,aisle_id,department_id,prices,departmend_id,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order,add_to_cart_order,reordered,_merge
0,1,Chocolate Sandwich Cookies,61,19,5.8,19,3139998,138,28,6,11,3.0,5,0,both
1,1,Chocolate Sandwich Cookies,61,19,5.8,19,1977647,138,30,6,17,20.0,1,1,both
2,1,Chocolate Sandwich Cookies,61,19,5.8,19,389851,709,2,0,21,6.0,20,0,both
3,1,Chocolate Sandwich Cookies,61,19,5.8,19,652770,764,1,3,13,NaN,10,0,both
4,1,Chocolate Sandwich Cookies,61,19,5.8,19,1813452,764,3,4,17,9.0,11,1,both
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
32404854,49688,Fresh Foaming Cleanser,73,11,13.5,11,1788356,200215,2,0,9,5.0,27,0,both
32404855,49688,Fresh Foaming Cleanser,73,11,13.5,11,3401313,200377,1,4,11,NaN,5,0,both
32404856,49688,Fresh Foaming Cleanser,73,11,13.5,11,809510,200873,5,3,8,15.0,12,0,both
32404857,49688,Fresh Foaming Cleanser,73,11,13.5,11,2359893,200873,9,3,15,5.0,11,1,both
32404858,49688,Fresh Foaming Cleanser,73,11,13.5,11,2385091,205926,11,1,15,6.0,35,0,both

# Step 7

### Export the merged data set

In [36]:
# check data's dimension before choosing how to import

df_merged.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32404859 entries, 0 to 32404858
Data columns (total 15 columns):
 #   Column                 Dtype
---  ------                 -----
 0   product_id             int32
 1   product_name           object
 2   aisle_id               int32
 3   department_id          int64
 4   prices                 float32
 5   departmend_id          int8
 6   order_id               int32
 7   user_id                int32
 8   order_number           int8
 9   orders_day_of_week     int8
 10  order_hour_of_day      int8
 11  days_since_last_order  float16
 12  add_to_cart_order      int32
 13  reordered              int8
 14  _merge                 category
dtypes: category(1), float16(1), float32(1), int32(5), int64(1), int8(5), object(1)
memory usage: 1.4+ GB

In [37]:
# Export 'df_merged' dataframe to 'Data Prepared' folder (pkl format)

df_merged.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'ords_prods_merge.pkl'))